system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     interFoam;

startFrom       latestTime;
startTime       0;

stopAt          endTime;
endTime         40;

deltaT          0.05;
maxDeltaT       0.1;      
maxCo           0.8;      
maxAlphaCo      1.0;

adjustTimeStep  yes;

writeControl    runTime;
writeInterval   0.3;      
purgeWrite      0;        

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //
