system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale 0.001;  

vertices
(
    (-30 -30 -5) // 0
    ( 30 -30 -5) // 1
    ( 30  30 -5) // 2
    (-30  30 -5) // 3
    (-30 -30  30) // 4
    ( 30 -30  30) // 5
    ( 30  30  30) // 6
    (-30  30  30) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 30) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3) // -X-Seite
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5) // +X-Seite
        );
    }

    front
    {
        type patch;
        faces
        (
            (0 1 5 4) // -Y
        );
    }

    back
    {
        type patch;
        faces
        (
            (3 7 6 2) // +Y
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 6 7) // +Z
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1) // -Z
        );
    }
);

mergePatchPairs ();

