system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    walls
    {
        type triSurfaceMesh;
        file "walls.stl";
    }
    inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }
    outlet
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }
     top
    {
        type triSurfaceMesh;
        file "top.stl";
    }

    box1
    {
        type searchableBox;
        min (-0.0015 -0.0015 0.000);
        max ( 0.0015  0.0015 0.006);
    }
     box2
    {
        type searchableBox;
        min (-0.004 -0.004 0.006);
        max ( 0.004  0.004 0.0105);
    }

}

castellatedMeshControls
{
    maxLocalCells        750000;
    maxGlobalCells       1400000;
    minRefinementCells   10;
    maxLoadUnbalance     0.10;
    nCellsBetweenLevels  3;

    features (      
        {
            file "inlet.extendedFeatureEdgeMesh";
            level 1;
        }
      
        {
            file "outlet.extendedFeatureEdgeMesh";
            level 1;
        }
    
         {
            file "walls.extendedFeatureEdgeMesh";
            level 1;
        }
        {
            file "top.extendedFeatureEdgeMesh";
            level 3;
        });

    resolveFeatureAngle 30;

    refinementSurfaces
    {
        walls
        {
            level (1 2);
        }
        inlet
        {
            level (1 1);
        }
        outlet
        {
            level (1 1);
        }
        top
        {
            level (2 3);
        }
    }

    refinementRegions
    {
        box1
        {
            mode inside;
            levels ((1 2));
        }
        box2
        {
            mode inside;
            levels ((1 2));
        }
        
    }

    locationInMesh (0.0 0.0 0.009);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch         5;
    tolerance            1.0;
    nSolveIter           30;
    nRelaxIter           5;
    nFeatureSnapIter     10;

    implicitFeatureSnap true;
    explicitFeatureSnap  true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes         true;
    layers
    {
        walls
        {
            nSurfaceLayers 3;
        }
    }
    expansionRatio        1.2;
    finalLayerThickness   0.3;
    minThickness          0.1;
    nGrow                 0;
    featureAngle          60;
    nRelaxIter            5;
    nSmoothSurfaceNormals 2;
    nSmoothNormals        5;
    nSmoothThickness      10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle    90;
    nBufferCellsNoExtrude 0;
    nLayerIter            50;
}

meshQualityControls
{
    maxNonOrtho        65;          
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-9;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.02;        
    minVolRatio         0.01;
    minTriangleTwist    -1;

    nSmoothScale        4;
    errorReduction      0.75;
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
