constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType laminar;

transportModel Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1e-06;

rho             rho [1 -3 0 0 0 0 0] 1000;
