constant/physicalProperties.water
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.blood;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  Newtonian;

nu              1e-06;   

rho             1000;       
