system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

walls
{
    surfaces ("walls.stl");

    includedAngle   45;

    subsetFeatures
    {
    
        insideBox       (-0.001 -0.001 0.0)(0.001 0.001 0.01);
    }
}

inlet
{
    surfaces ("inlet.stl");

    includedAngle   30;

    subsetFeatures
    {
    
        insideBox       (-0.001 -0.001 0.019)(0.001 0.001 0.021);
    }
}

outlet
{
    surfaces ("outlet.stl");

    includedAngle   30;

    subsetFeatures
    {
    
        insideBox       (-0.007 -0.007 -0.001)(0.007 0.007 0.001);
    }
}
top
{
    surfaces ("top.stl");

    includedAngle   30;

    subsetFeatures
    {
    
        insideBox       (-0.001 -0.001 0.009)(0.001 0.001 0.011);
    }
}
